timevaryingBC_buoyantPimpleFoam/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default	    Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;

    div(phi,U)      bounded Gauss limitedLinear 0.2;

    energy          bounded Gauss limitedLinear 0.2;
    div(phi,K)      $energy;
    div(phi,h)      $energy;

    turbulence      bounded Gauss limitedLinear 0.2;
    div(phi,k)      $turbulence;
    div(phi,epsilon) $turbulence;
    div(phi,omega) $turbulence;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;

    div(phi,R)      Gauss Upwind;
    div(phi,e)      Gauss Upwind;
    div(phi,Ekp)    Gauss Upwind;
    div(R)          Gauss Upwind;
    div(Ji,Ii_h)    Gauss linearUpwind grad(Ii_h);
}

laplacianSchemes
{
    default         Gauss linear orthogonal;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method          meshWave;
}


// ************************************************************************* //
